app/controllers/followers_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "followers" ("user_id", "follows_user", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["follows_user", 1], ["created_at", "2020-11-22 21:07:32.003996"], ["updated_at", "2020-11-22 21:07:32.003996"]]
---
	def create
		@user = User.find(current_user.id)
		@followed = follower_params[:follows_user]
		@follower = @user.followers.create(follower_params)