app/controllers/notifications_controller.rb

	def index
		require 'date'

		@user = User.find(params[:user_id])
		@follows_count = Follower.where(follows_user: current_user.id, notified: false).count
		@notifications = Follower.where(follows_user: current_user.id).order(created_at: :desc)

		#Atualizando status do follow como notificado
		if @follows_count > 0
			follow = Follower.where(follows_user: current_user.id, notified: false).update_all(notified: true)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "followers" WHERE "followers"."follows_user" = $1 AND "followers"."notified" = $2  [["follows_user", 1], ["notified", false]]
SELECT "followers".* FROM "followers" WHERE "followers"."follows_user" = $1 ORDER BY "followers"."created_at" DESC  [["follows_user", 2]]
SELECT "followers".* FROM "followers" WHERE "followers"."follows_user" = $1 LIMIT $2  [["follows_user", 1], ["LIMIT", 1]]
UPDATE "followers" SET "notified" = $1 WHERE "followers"."id" IN (SELECT "followers"."id" FROM "followers" WHERE "followers"."follows_user" = $2 LIMIT $3)  [["notified", true], ["follows_user", 1], ["LIMIT", 1]]