app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "followers" WHERE "followers"."follows_user" = $1 AND "followers"."notified" = $2  [["follows_user", 1], ["notified", false]]
---
	def index
		@user = User.find(params[:user_id])
		@posts = Post.order(created_at: :desc)

		@follows = Follower.where(follows_user: @user.id, notified: false).count

SELECT "posts".* FROM "posts"
---
    def new
		@posts = Post.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Posts reparados, follows e notificações funcionando."], ["user_id", 1], ["created_at", "2020-11-22 23:10:01.310695"], ["updated_at", "2020-11-22 23:10:01.310695"]]
---
    def create
		@user = User.find(params[:user_id])
		@post = @user.posts.create(post_params)