app/controllers/users_controller.rb

	def index
		@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def show
		@user = User.find(params[:id])
		@posts = Post.where(user_id: @user).order("created_at desc")

		if Follower.where(user_id: current_user.id, follows_user: @user.id).count > 0
			@follow = true
		end

		@follows = Follower.where(follows_user: @user.id, notified: false).count
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."order" = ?  [["user_id", 1], ["order", "created_at"]]
SELECT COUNT(*) FROM "followers" WHERE "followers"."user_id" = $1 AND "followers"."follows_user" = $2  [["user_id", 1], ["follows_user", 2]]
SELECT COUNT(*) FROM "followers" WHERE "followers"."follows_user" = $1 AND "followers"."notified" = $2  [["follows_user", 1], ["notified", false]]